## Plan Result (765: prod_apim_appgw - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.app-gw.azurerm_application_gateway.ag[0] must be replaced
-/+ resource "azurerm_application_gateway" "ag" {
      - enable_http2                      = false -> null
      - fips_enabled                      = false -> null
      - force_firewall_policy_association = false -> null
      ~ id                                = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw" -> (known after apply)
        name                              = "cft-apim00-prod-agw"
      ~ private_endpoint_connection       = [] -> (known after apply)
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      - zones                             = [ # forces replacement
          - "1",
          - "2",
          - "3",
        ] -> null
        # (3 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [
              - "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ] -> null
          - id           = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/cft-mtls-api-mgmt-appgw-address-pool" -> null
          - ip_addresses = [] -> null
          - name         = "cft-mtls-api-mgmt-appgw-address-pool" -> null
        }
      - backend_address_pool {
          - fqdns        = [
              - "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ] -> null
          - id           = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-address-pool" -> null
          - ip_addresses = [] -> null
          - name         = "civil-sdt-address-pool" -> null
        }
      - backend_address_pool {
          - fqdns        = [
              - "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ] -> null
          - id           = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-commissioning-address-pool" -> null
          - ip_addresses = [] -> null
          - name         = "civil-sdt-commissioning-address-pool" -> null
        }
      - backend_address_pool {
          - fqdns        = [
              - "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ] -> null
          - id           = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-test-address-pool" -> null
          - ip_addresses = [] -> null
          - name         = "civil-sdt-test-address-pool" -> null
        }
      + backend_address_pool {
          + fqdns        = [
              + "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "cft-mtls-api-mgmt-appgw-address-pool"
        }
      + backend_address_pool {
          + fqdns        = [
              + "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "civil-sdt-address-pool"
        }
      + backend_address_pool {
          + fqdns        = [
              + "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "civil-sdt-commissioning-address-pool"
        }
      + backend_address_pool {
          + fqdns        = [
              + "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "civil-sdt-test-address-pool"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw-http-settings" -> null
          - name                                = "cft-mtls-api-mgmt-appgw-http-settings" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/cft-mtls-api-mgmt-appgw-probe" -> null
          - probe_name                          = "cft-mtls-api-mgmt-appgw-probe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings" -> null
          - name                                = "civil-sdt-commissioning-http-settings" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-commissioning-probe" -> null
          - probe_name                          = "civil-sdt-commissioning-probe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (2 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-http-settings" -> null
          - name                                = "civil-sdt-http-settings" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-probe" -> null
          - probe_name                          = "civil-sdt-probe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (2 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-test-http-settings" -> null
          - name                                = "civil-sdt-test-http-settings" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-test-probe" -> null
          - probe_name                          = "civil-sdt-test-probe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (2 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "cft-mtls-api-mgmt-appgw-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "cft-mtls-api-mgmt-appgw-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                  = (known after apply)
          + name                                = "civil-sdt-commissioning-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "civil-sdt-commissioning-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (2 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                  = (known after apply)
          + name                                = "civil-sdt-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "civil-sdt-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (2 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                  = (known after apply)
          + name                                = "civil-sdt-test-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "civil-sdt-test-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (2 unchanged attributes hidden)
        }

      ~ frontend_ip_configuration {
          ~ id                              = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> (known after apply)
            name                            = "appGwPublicFrontendIp"
          + private_ip_address              = (known after apply)
          + private_link_configuration_id   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ frontend_ip_configuration {
          ~ id                              = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> (known after apply)
            name                            = "appGwPrivateFrontendIp"
          + private_link_configuration_id   = (known after apply)
            # (5 unchanged attributes hidden)
        }

      - frontend_port {
          - id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/http" -> null
          - name = "http" -> null
          - port = 80 -> null
        }
      - frontend_port {
          - id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - name = "https" -> null
          - port = 443 -> null
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      ~ gateway_ip_configuration {
          ~ id        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/gatewayIPConfigurations/gateway" -> (known after apply)
            name      = "gateway"
            # (1 unchanged attribute hidden)
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - name                           = "cft-mtls-api-mgmt-appgw" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/wildcard-platform-hmcts-net" -> null
          - ssl_certificate_name           = "wildcard-platform-hmcts-net" -> null
          - ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/cft-mtls-api-mgmt-appgw-sslprofile" -> null
          - ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "commissioning.sdt.justice.gov.uk" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-commissioning" -> null
          - name                           = "civil-sdt-commissioning" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-commissioning-prod" -> null
          - ssl_certificate_name           = "civil-sdt-commissioning-prod" -> null
          - ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-commissioning-sslprofile" -> null
          - ssl_profile_name               = "civil-sdt-commissioning-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "sdt.justice.gov.uk" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt" -> null
          - name                           = "civil-sdt" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-prod" -> null
          - ssl_certificate_name           = "civil-sdt-prod" -> null
          - ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-sslprofile" -> null
          - ssl_profile_name               = "civil-sdt-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "testdt.justice.gov.uk" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-test" -> null
          - name                           = "civil-sdt-test" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/civil-sdt-commissioning-prod" -> null
          - ssl_certificate_name           = "civil-sdt-commissioning-prod" -> null
          - ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-test-sslprofile" -> null
          - ssl_profile_name               = "civil-sdt-test-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "cft-mtls-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile"
            # (1 unchanged attribute hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "commissioning.sdt.justice.gov.uk"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "civil-sdt-commissioning"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "civil-sdt-commissioning-prod"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "civil-sdt-commissioning-sslprofile"
            # (1 unchanged attribute hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "sdt.justice.gov.uk"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "civil-sdt"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "civil-sdt-prod"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "civil-sdt-sslprofile"
            # (1 unchanged attribute hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "testdt.justice.gov.uk"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "civil-sdt-test"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "civil-sdt-commissioning-prod"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "civil-sdt-test-sslprofile"
            # (1 unchanged attribute hidden)
        }

      ~ identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (2 unchanged attributes hidden)
        }

      - probe {
          - host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/cft-mtls-api-mgmt-appgw-probe" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "cft-mtls-api-mgmt-appgw-probe" -> null
          - path                                      = "/status-0123456789abcdef" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-commissioning-probe" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "civil-sdt-commissioning-probe" -> null
          - path                                      = "/status-0123456789abcdef" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-probe" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "civil-sdt-probe" -> null
          - path                                      = "/status-0123456789abcdef" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/civil-sdt-test-probe" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "civil-sdt-test-probe" -> null
          - path                                      = "/status-0123456789abcdef" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "cft-mtls-api-mgmt-appgw-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "civil-sdt-commissioning-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "civil-sdt-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "civil-sdt-test-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/cft-mtls-api-mgmt-appgw-address-pool" -> null
          - backend_address_pool_name   = "cft-mtls-api-mgmt-appgw-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw-http-settings" -> null
          - backend_http_settings_name  = "cft-mtls-api-mgmt-appgw-http-settings" -> null
          - http_listener_id            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - http_listener_name          = "cft-mtls-api-mgmt-appgw" -> null
          - id                          = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/requestRoutingRules/cft-mtls-api-mgmt-appgw" -> null
          - name                        = "cft-mtls-api-mgmt-appgw" -> null
          - priority                    = 10 -> null
          - rewrite_rule_set_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule" -> null
          - rewrite_rule_set_name       = "cft-mtls-api-mgmt-appgw-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-http-settings" -> null
          - http_listener_id            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt" -> null
          - http_listener_name          = "civil-sdt" -> null
          - id                          = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/requestRoutingRules/civil-sdt" -> null
          - name                        = "civil-sdt" -> null
          - priority                    = 30 -> null
          - rewrite_rule_set_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-commissioning-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-commissioning-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-commissioning-http-settings" -> null
          - http_listener_id            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-commissioning" -> null
          - http_listener_name          = "civil-sdt-commissioning" -> null
          - id                          = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/requestRoutingRules/civil-sdt-commissioning" -> null
          - name                        = "civil-sdt-commissioning" -> null
          - priority                    = 20 -> null
          - rewrite_rule_set_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-commissioning-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/civil-sdt-test-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-test-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/civil-sdt-test-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-test-http-settings" -> null
          - http_listener_id            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/civil-sdt-test" -> null
          - http_listener_name          = "civil-sdt-test" -> null
          - id                          = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/requestRoutingRules/civil-sdt-test" -> null
          - name                        = "civil-sdt-test" -> null
          - priority                    = 40 -> null
          - rewrite_rule_set_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-test-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-test-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "cft-mtls-api-mgmt-appgw-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "cft-mtls-api-mgmt-appgw-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "cft-mtls-api-mgmt-appgw"
          + id                          = (known after apply)
          + name                        = "cft-mtls-api-mgmt-appgw"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "cft-mtls-api-mgmt-appgw-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "civil-sdt-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "civil-sdt-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "civil-sdt"
          + id                          = (known after apply)
          + name                        = "civil-sdt"
          + priority                    = 30
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "civil-sdt-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "civil-sdt-commissioning-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "civil-sdt-commissioning-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "civil-sdt-commissioning"
          + id                          = (known after apply)
          + name                        = "civil-sdt-commissioning"
          + priority                    = 20
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "civil-sdt-commissioning-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "civil-sdt-test-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "civil-sdt-test-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "civil-sdt-test"
          + id                          = (known after apply)
          + name                        = "civil-sdt-test"
          + priority                    = 40
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "civil-sdt-test-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ rewrite_rule_set {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule" -> (known after apply)
            name = "cft-mtls-api-mgmt-appgw-rewriterule"

            # (1 unchanged block hidden)
        }
      ~ rewrite_rule_set {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule" -> (known after apply)
            name = "civil-sdt-commissioning-rewriterule"

            # (2 unchanged blocks hidden)
        }
      ~ rewrite_rule_set {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-rewriterule" -> (known after apply)
            name = "civil-sdt-rewriterule"

            # (2 unchanged blocks hidden)
        }
      ~ rewrite_rule_set {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/civil-sdt-test-rewriterule" -> (known after apply)
            name = "civil-sdt-test-rewriterule"

            # (2 unchanged blocks hidden)
        }

      ~ sku {
          - capacity = 0 -> null
            name     = "WAF_v2"
            # (1 unchanged attribute hidden)
        }

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ ssl_policy (known after apply)
      - ssl_policy {
          - cipher_suites        = [] -> null
          - disabled_protocols   = [] -> null
          - policy_name          = "AppGwSslPolicy20150501" -> null
          - policy_type          = "Predefined" -> null
            # (1 unchanged attribute hidden)
        }

      ~ ssl_profile {
          ~ id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/cft-mtls-api-mgmt-appgw-sslprofile" -> (known after apply)
            name                                 = "cft-mtls-api-mgmt-appgw-sslprofile"
            # (3 unchanged attributes hidden)
        }
      ~ ssl_profile {
          ~ id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-commissioning-sslprofile" -> (known after apply)
            name                                 = "civil-sdt-commissioning-sslprofile"
            # (3 unchanged attributes hidden)
        }
      ~ ssl_profile {
          ~ id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-sslprofile" -> (known after apply)
            name                                 = "civil-sdt-sslprofile"
            # (3 unchanged attributes hidden)
        }
      ~ ssl_profile {
          ~ id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-test-sslprofile" -> (known after apply)
            name                                 = "civil-sdt-test-sslprofile"
            # (3 unchanged attributes hidden)
        }

      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/cft-mtls-api-mgmt-appgw-liberata_ca" -> (known after apply)
            name = "cft-mtls-api-mgmt-appgw-liberata_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/cft-mtls-api-mgmt-appgw-exela_ca" -> (known after apply)
            name = "cft-mtls-api-mgmt-appgw-exela_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/cft-mtls-api-mgmt-appgw-reform_scan_sscs_ca" -> (known after apply)
            name = "cft-mtls-api-mgmt-appgw-reform_scan_sscs_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/cft-mtls-api-mgmt-appgw-pcipal_ca" -> (known after apply)
            name = "cft-mtls-api-mgmt-appgw-pcipal_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/cft-mtls-api-mgmt-appgw-pcipal_ssl_com_intermediate_ca" -> (known after apply)
            name = "cft-mtls-api-mgmt-appgw-pcipal_ssl_com_intermediate_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/cft-mtls-api-mgmt-appgw-pcipal_ssl_com_root_ca" -> (known after apply)
            name = "cft-mtls-api-mgmt-appgw-pcipal_ssl_com_root_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-commissioning-civil_sdt_root_ca" -> (known after apply)
            name = "civil-sdt-commissioning-civil_sdt_root_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-civil_sdt_root_ca" -> (known after apply)
            name = "civil-sdt-civil_sdt_root_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-test-civil_sdt_root_ca" -> (known after apply)
            name = "civil-sdt-test-civil_sdt_root_ca"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      ~ id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw|AppGw" -> (known after apply)
      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
        name                           = "AppGw"
      ~ target_resource_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ enabled_log (known after apply)

      ~ log (known after apply)
      - log {
          - category       = "ApplicationGatewayAccessLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayFirewallLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayPerformanceLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      ~ metric (known after apply)
      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2536,"Program":"tfcmt","SHA1":"","Target":"765: prod_apim_appgw - TerraformPlanApply","Vars":{}} -->